{
  "about": "<p><strong><i>Front-End</i></strong> Developer with a Bachelor of <strong>Computer Science</strong> degree, I live in <strong>Brazil</strong> but one day I still want to move to <strong>Canada</strong>!</p><p>I have been working with Web Development since 2013, I have also worked with <i>Back-End</i> but today my focus is <i>Front-End</i> using technologies such as <i>React.js</i>, <i>Redux</i>, <i>Javascript</i>, <i>HTML5</i>, <i>CSS3</i>, <i>SASS</i>, <i>PHP</i>, <i>Node.js</i> and others.</p><p>During this period I was able to participate in several projects, get involved in the methodology of great teams and share my knowledge with colleagues in the area.</p><p>I also like to keep myself updated and connected with the development community in general, going to events, participating in groups or even following the professionals and companies that stand out.</p><p>So I always try to keep this page up to date so that people can also know a little about me!</p>",
  "skills": {
    "english": [
      {
        "title": "Listening/Speaking",
        "score": 3
      },
      {
        "title": "Reading/Writing",
        "score": 4
      }
    ],
    "solidKnowledge": ["HTML5", "CSS3", "JAVASCRIPT", "REACT.JS", "REDUX", "STYLED-COMPONENTS", "SASS", "GULP", "REST APIS", "GIT", "NPM SCRIPTS", "RESPONSIVE DESIGN", "MOBILE FIRST"],
    "experienceWith": ["PHP", "MYSQL", "NODE.JS", "VUE.JS", "UI/UX DESIGN", "SERVERLESS", "LAMBDA", "MONGODB", "CI/CD", "AUTOMATED TESTS", "SEO"]
  },
  "experiences": [
    {
      "title": "Senior Front-End Developer",
      "where": "CARGOBR",
      "when": "Feb/2019 to Current Job",
      "about": "Acting remotely as a senior front-end developer dealing directly with the development and structure of the website applications, freight quote pages, order dashboard and other internal projects, as well as back-end integration, unit testing and end-to- end.",
      "skills": "HTML5, CSS3, SASS, Javascript, React, Redux, Styled-Components, Jest, Enzyme, Cypress, REST API, GIT, Continuous Delivery, Continuous Integration, Bitbucket Pipelines, End-to-End Tests, Unit Tests, Scrum.",
      "image": "cargobr.jpg"
    },
    {
      "title": "Lead Front-End Developer",
      "where": "BG7",
      "when": "Oct/2018 to Feb/2019",
      "about": "Development of web applications with React and integration of data with the Back-End via API Rest. Project structure and organization of the front-end team.",
      "skills": "Team leader, Scrum, HTML5, CSS3, Javascript, React, Redux, Styled-Components, SASS, Node.js, Git, REST API, Cypress E2E Tests.",
      "image": "bg7.jpg"
    },
    {
      "title": "Front-End Developer",
      "where": "SmartMei",
      "when": "Jul/2018 to Oct/2018",
      "about": "Front-end development of reusable components with React and Typescript. Study and implementation of mockups. Data integration with Back-End using GraphQL and ApolloClient.",
      "skills": "HTML5, CSS3, Javascript, React, Redux, Typescript, SASS, Material Ui, Node.js, Heroku, Git, Unit Testing, GraphQL, Prototyping, Mockups, Figma, Invision.",
      "image": "smartmei.jpg"
    },
    {
      "title": "Front-End Developer",
      "where": "LojasKD",
      "when": "Apr/2017 to Jul/2018",
      "about": "Front-end development for e-commerce and its in-house projects, streaming UX / UI jobs to improve store performance, usability, and conversion. Performance in multidisciplinary squads with results measured through KPIs and OKRs.",
      "skills": "HTML5, CSS3, PHP, Javascript, React, Redux, Styled-Components, SASS,  Next.js, Node.js, MongoDB, Lambda, Serverless, GIT, Docker, Continuous  Delivery, Pipelines, End-to-End Testing, A/B Testing, UX.",
      "image": "lojaskd.jpg"
    },
    {
      "title": "Web Developer",
      "where": "Tática Web",
      "when": "Sep/2013 to Mar/2017",
      "about": "Development of institutional websites, e-commerces and web systems using HTML5, CSS3, jQuery, PHP and MySQL. Responsive and mobile first design. Performance and page optimization.",
      "skills": "HTML5, CSS3, Javascript, PHP, Wordpress, MySql, Responsive Design, Mobile First, Cross-Browser, SEO.",
      "image": "taticaweb.jpg"
    },
    {
      "title": "IT Trainee",
      "where": "Caixa Econômica Federal",
      "when": "Feb/13 to Sep/13",
      "about": "IT support for office users. Feeding internal systems to monitor transaction data and services captured through webservice. Development and maintenance of intranet site.",
      "image": "caixa.jpg"
    }
  ],
  "academic": [
    {
      "title": "Computer Science",
      "where": "UBM",
      "when": "Feb/2011 to Dec/2014",
      "about": "The development of a Home Automation System was presented, as a course conclusion work, using Arduino to control the components of the residence through a web interface available for computers, cell phones or any device with internet access.",
      "skills": "Arduíno, C, HTML5, CSS3, Javascript, PHP, Apache.",
      "image": "ubm.jpg"
    }
  ],
  "portfolio": [
    {
      "title": "Sweet Home Pet",
      "link": "https://www.figma.com/proto/SpoXhe7UljsQHjgeEuAAfhSr/SweetHomePet?node-id=0%3A1&scaling=min-zoom",
      "image": "sweethomepet.jpg",
      "hashtags": ["UI/UXDesign", "LogoDesign"]
    },
    {
      "title": "New York Tourism and Transport",
      "link": "http://www.newyorktt.com.br/",
      "image": "nytt.jpg",
      "hashtags": ["FrontEndDevelopment"]
    },
    {
      "title": "Mais Abraços",
      "link": "http://www.maisabracos.com.br",
      "image": "maisabracos.jpg",
      "hashtags": ["FrontEndDevelopment"]
    },
    {
      "title": "Codepen",
      "link": "http://www.codepen.io/cecelabomfim",
      "image": "codepen.jpg",
      "hashtags": ["Experiments"]
    }
  ]
}
