{
  "about": "<p>Desenvolvedora <strong><i>Front-End</i></strong> graduada em <strong>Ciência da Computação</strong>, moro em <strong>Volta Redonda/RJ</strong> mas um dia ainda vou me mudar para o <strong>Canadá</strong>!</p><p>Trabalho com Desenvolvimento Web desde 2013, já atuei também com <i>Back-End</i> mas hoje o meu foco é <i>Front-End</i> utilizando tecnologias como <i>React.js</i>, <i>Redux</i>, <i>Javascript</i>, <i>HTML5</i>, <i>CSS3</i>, <i>SASS</i>, <i>PHP</i>, <i>Node.js</i> e outras.</p><p>Durante esse período pude participar de diversos projetos, me envolver na metodologia de ótimas equipes e compartilhar meus conhecimentos com colegas da área.</p><p>Também gosto de me manter atualizada e conectada com a comunidade de desenvolvimento no geral, indo à eventos, participando de grupos ou mesmo seguindo os profissionais e as empresas que se destacam.</p><p>Por isso tento sempre manter essa página atualizada para que as pessoas também possam conhecer um pouco sobre mim!</p>",
  "skills": {
    "english": [
      {
        "title": "Listening/Speaking",
        "score": 2
      },
      {
        "title": "Reading/Writing",
        "score": 3
      }
    ],
    "solidKnowledge": ["HTML5", "CSS3", "JAVASCRIPT", "REACT.JS", "REDUX", "STYLED-COMPONENTS", "SASS", "GULP", "REST APIS", "GIT", "NPM SCRIPTS", "RESPONSIVE DESIGN", "MOBILE FIRST"],
    "experienceWith": ["PHP", "MYSQL", "NODE.JS", "VUE.JS", "UI/UX DESIGN", "SERVERLESS", "LAMBDA", "MONGODB", "CI/CD", "AUTOMATED TESTS", "SEO"]
  },
  "experiences": [
    {
      "title": "Desenvolvedora Front-End Sênior",
      "where": "CARGOBR",
      "when": "Fev/19 a Atual",
      "about": "Atuando remotamente como desenvolvedora front-end sênior lidando diretamente com o desenvolvimento e estrutura das aplicações do site, páginas de cotação de fretes, dashboard de pedidos e outros projetos internos, além da integração com Back-End, testes unitários e testes end-to-end.",
      "skills": "HTML5, CSS3, SASS, Javascript, React, Redux, Styled-Components, Jest, Enzyme, Cypress, REST API, GIT, Continuous Delivery, Continuous Integration, Bitbucket Pipelines, End-to-End Tests, Unit Tests, Scrum.",
      "image": "cargobr.jpg"
    },
    {
      "title": "Desenvolvedora Front-End Líder",
      "where": "BG7",
      "when": "Out/18 a Fev/19",
      "about": "Atuação como líder e desenvolvedora em dois projetos lidando diretamente com a estrutura das aplicações, organização do time, Desenvolvimento Front-End com React e integração de dados com o Back-End via API Rest.",
      "skills": "Team leader, Scrum, HTML5, CSS3, Javascript, React, Redux, Styled-Components, SASS, Node.js, Git, REST API, Cypress E2E Tests.",
      "image": "bg7.jpg"
    },
    {
      "title": "Desenvolvedora Front-End",
      "where": "SmartMei",
      "when": "Jul/18 a Set/18",
      "about": "Processo de migração do Front-End de uma aplicação de Angular para React e Typescript. Estudo e implementação de mockups. Integração de dados com o Back-End utilizando GraphQL e ApolloClient.",
      "skills": "HTML5, CSS3, Javascript, React, Redux, Typescript, SASS, Material Ui, Node.js, Heroku, Git, Unit Testing, GraphQL, Prototyping, Mockups, Figma, Invision.",
      "image": "smartmei.jpg"
    },
    {
      "title": "Desenvolvedora Front-End",
      "where": "LojasKD",
      "when": "Abr/17 a Jul/18",
      "about": "Desenvolvimento Front-end para o e-commerce e seus projetos internos, dando sequência aos trabalhos de UX/UI a fim de melhorar o desempenho, usabilidade e conversão da loja. Atuação em squads multidisciplinares com resultados medidos através de KPIs e OKRs.",
      "skills": "HTML5, CSS3, PHP, Javascript, React, Redux, Styled-Components, SASS,  Next.js, Node.js, MongoDB, Lambda, Serverless, GIT, Docker, Continuous  Delivery, Pipelines, End-to-End Testing, A/B Testing, UX.",
      "image": "lojaskd.jpg"
    },
    {
      "title": "Desenvolvedora Web",
      "where": "Tática Web",
      "when": "Set/13 a Mar/17",
      "about": "Desenvolvimento de sites institucionais, lojas virtuais e sistemas web  utilizando. Design responsivo e mobile first. Desempenho e otimização de páginas.",
      "skills": "HTML5, CSS3, Javascript, PHP, Wordpress, MySql, Responsive Design, Mobile First, Cross-Browser, SEO.",
      "image": "taticaweb.jpg"
    },
    {
      "title": "Estagiária de TI",
      "where": "Caixa Econômica Federal",
      "when": "Fev/13 a Set/13",
      "about": "Suporte em TI aos usuários do escritório. Alimentação de sistemas internos para acompanhamento de dados de transações e serviços capturados através de webservice. Desenvolvimento e manutenção de site intranet.",
      "image": "caixa.jpg"
    }
  ],
  "academic": [
    {
      "title": "Ciência da Computação",
      "where": "UBM",
      "when": "Fev 2011 a Dez 2014",
      "about": "Apresentado o desenvolvimento de um Sistema de Automação Residencial, como trabalho de conclusão de curso, utilizando Arduíno para controlar os componentes da residência através de uma interface Web disponível para computadores, celulares ou qualquer dispositivo com acesso à internet.",
      "skills": "Arduíno, C, HTML5, CSS3, Javascript, PHP, Apache.",
      "image": "ubm.jpg"
    }
  ],
  "portfolio": [
    {
      "title": "Sweet Home Pet",
      "link": "https://www.figma.com/proto/SpoXhe7UljsQHjgeEuAAfhSr/SweetHomePet?node-id=0%3A1&scaling=min-zoom",
      "image": "sweethomepet.jpg",
      "hashtags": ["UI/UXDesign", "LogoDesign"]
    },
    {
      "title": "New York Tourism and Transport",
      "link": "http://www.newyorktt.com.br/",
      "image": "nytt.jpg",
      "hashtags": ["DesenvolvimentoFrontEnd"]
    },
    {
      "title": "Mais Abraços",
      "link": "http://www.maisabracos.com.br",
      "image": "maisabracos.jpg",
      "hashtags": ["DesenvolvimentoFrontEnd"]
    },
    {
      "title": "Codepen",
      "link": "http://www.codepen.io/cecelabomfim",
      "image": "codepen.jpg",
      "hashtags": ["Experimentos"]
    }
  ]
}
